app/controllers/buys_controller.rb

SELECT "buys".* FROM "buys"
---
  def index
    @buys = Buy.all

INSERT INTO "buys" ("webtoon_id", "episode_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["webtoon_id", 2], ["episode_id", 7], ["created_at", "2021-12-08 10:30:33.892697"], ["updated_at", "2021-12-08 10:30:33.892697"]]
---
  def create
    @buy = Buy.new(buy_params)

    respond_to do |format|
      if @buy.save

SELECT  "buys".* FROM "buys" WHERE "buys"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_buy
      @buy = Buy.find(params[:id])