app/controllers/comment2s_controller.rb

  def index
    @comment2s = Comment2.all
---
SELECT "comment2s".* FROM "comment2s"

  def create
    @comment2 = Comment2.new(comment2_params)

    respond_to do |format|
      if @comment2.save
---
INSERT INTO "comment2s" ("episode_id", "user_id", "usercomment2", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["episode_id", 1], ["user_id", 1], ["usercomment2", "ssssssssssssssssssssssssss"], ["created_at", "2021-12-08 12:58:51.856562"], ["updated_at", "2021-12-08 12:58:51.856562"]]

    def set_comment2
      @comment2 = Comment2.find(params[:id])
---
SELECT  "comment2s".* FROM "comment2s" WHERE "comment2s"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]