app/controllers/episodes_controller.rb

SELECT "episodes".* FROM "episodes"
---
  def index
    @episodes = Episode.all

SELECT  "webtoons".* FROM "webtoons" ORDER BY "webtoons"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "comment2s".* FROM "comment2s" WHERE "comment2s"."episode_id" = $1  [["episode_id", 1]]
---
  def show
	  @buys = Buy.all
	  @buy = Buy.new
	  @webtoons = Webtoon.all
	  @webtoon = Webtoon.new
	  @comment2s = Comment2.where(episode_id: @episode.id)

INSERT INTO "episodes" ("round", "cookiecount", "registration", "content", "scope", "webtoon_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @episode = Episode.new(episode_params)

    respond_to do |format|
      if @episode.save

SELECT  "episodes".* FROM "episodes" WHERE "episodes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_episode
      @episode = Episode.find(params[:id])