app/controllers/homes_controller.rb

  def index
    @homes = Home.all
	@webtoons = Webtoon.all
---
SELECT "homes".* FROM "homes"
SELECT  "webtoons".* FROM "webtoons" ORDER BY "webtoons"."id" ASC LIMIT $1  [["LIMIT", 1]]