app/controllers/homepages_controller.rb

SELECT "homepages".* FROM "homepages"
---
  def index
    @homepages = Homepage.all