app/controllers/webtoons_controller.rb

  def index
    @webtoons = Webtoon.all
---
SELECT "webtoons".* FROM "webtoons"

  def show
	  @episodes = Episode.all
---
SELECT  "episodes".* FROM "episodes" ORDER BY "episodes"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def create
    @webtoon = Webtoon.new(webtoon_params)

    respond_to do |format|
      if @webtoon.save
---
INSERT INTO "webtoons" ("webtoonname", "author", "genre", "summary", "day", "stardate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["webtoonname", "1"], ["author", ""], ["genre", ""], ["summary", ""], ["day", ""], ["stardate", ""], ["created_at", "2021-12-08 08:16:41.755840"], ["updated_at", "2021-12-08 08:16:41.755840"]]

  def destroy
    @webtoon.destroy
---
DELETE FROM "webtoons" WHERE "webtoons"."id" = $1  [["id", 1]]

    def set_webtoon
      @webtoon = Webtoon.find(params[:id])
---
SELECT  "webtoons".* FROM "webtoons" WHERE "webtoons"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]